Repository: dslm4515/MLFS-pkgtool
Catalog: contrib/tar-1.13/po/*.po
Languages: cs, pl

source: Unknown system error
cs: Neznámá systémová chyba
pl: Nieznany b³±d systemu

source: Memory exhausted
cs: Pamì» vyèerpána
pl: Brak pamiêci

source: Total bytes written:
cs: Bajtù zapsáno celkem:
pl: Ca³kowita zapisana ilo¶æ bajtów:

source: Cannot close file #%d
cs: Soubor #%d není mo¾né uzavøít
pl: Nie mogê zamkn±æ pliku #%d

source: Cannot close descriptor %d
cs: Popisovaè %d není mo¾né uzavøít
pl: Nie mogê zamkn±æ deskryptora %d

source: Cannot properly duplicate %s
cs: %s není mo¾né duplikovat
pl: Nie mogê prawied³owo powieliæ %s

source: Cannot use compressed or remote archives
cs: Komprimované nebo vzdálené archívy nelze pou¾ít
pl: Nie mogê u¿yæ archiwum skompresowanego lub zdalnego

source: Cannot open pipe
cs: Rouru nelze otevøít
pl: Nie mogê zamkn±æ potoku

source: Cannot fork
cs: Nový proces nelze vytvoøit
pl: Nie mogê rozwidliæ procesu

source: tar (child)
cs: tar (potomek)
pl: tar (potomny)

source: (child) Pipe to stdin
cs: (potomek) Roura na stdin
pl: (proces potomny) potok do stdin

source: Cannot open archive %s
cs: Archiv %s není mo¾né otevøít
pl: Nie mogê otworzyæ archiwum %s

source: Archive to stdout
cs: Archivace na stdout
pl: Archiwizujê do stdout

source: Cannot exec %s
cs: %s není mo¾né spustit
pl: Nie mogê wykonaæ %s

source: Child cannot fork
cs: Potomek nemù¾e vytvoøit nový proces
pl: Proces potomny nie mo¿e rozwidliæ procesu

source: ((child)) Pipe to stdout
cs: ((potomek)) Roura na stdout
pl: ((proces potomny)) potok do stdout

source: tar (grandchild)
cs: tar (prapotomek)
pl: tar (wnuczek)

source: (grandchild) Pipe to stdin
cs: (prapotomek) Roura na stdin
pl: (wnuczek) potok do stdin

source: Cannot read from compression program
cs: Z kompresního programu nelze èíst
pl: Nie mogê czytaæ z programu kompresuj±cego

source: (child) Pipe to stdout
cs: (potomek) Roura na stdout
pl: (proces potomny) potok do stdout

source: Archive to stdin
cs: Archivace na stdin
pl: Archiwizujê do stdin

source: ((child)) Pipe to stdin
cs: ((potomek)) Roura na stdin
pl: ((proces potomny)) potok do stdin

source: (grandchild) Pipe to stdout
cs: (prapotomek) Roura na stdout
pl: (wnuczek) potok do stdout

source: Cannot write to compression program
cs: Do kompresního programu nelze zapisovat
pl: Nie mogê pisaæ do programu kompresuj±cego

source: Invalid value for record_size
cs: Chybná hodnota pro velikost záznamu
pl: B³êdna warto¶æ record_size

source: No archive name given
cs: Jméno archivu nebylo zadáno
pl: Nie podana nazwa archiwum

source: Could not allocate memory for blocking factor %d
cs: Pro blokový faktor (blokù na záznam) %d není mo¾né alokovat pamì»
pl: Nie mog³em przydzieliæ pamiêci dla bloków %d

source: Cannot verify multi-volume archives
cs: Vícesvazkový archív není mo¾né ovìøit
pl: Nie mogê zweryfikowaæ archiwum wieloczê¶ciowego

source: Cannot use multi-volume compressed archives
cs: Vícesvazkový komprimovaný archív nelze vytvoøit
pl: Nie mogê u¿ywaæ wielocze¶ciowego archiwum skompresowanego

source: Cannot verify compressed archives
cs: Komprimovaný archív nelze ovìøit
pl: Nie mogê zweryfikowaæ archiwum skompresowanego

source: Cannot update compressed archives
cs: Komprimovaný archív nelze aktualizovat
pl: Nie mogê uaktualniæ archiwum skompresowanego

source: Cannot verify stdin/stdout archive
cs: Stdin/Stdout archív nelze ovìøit
pl: Nie mogê zweryfikowaæ archiwum z/do stdin/stdout

source: Cannot open %s
cs: %s nelze otevøít
pl: Nie mogê otworzyæ %s

source: Archive not labelled to match `%s'
cs: Pro vyhodnocení vzorku `%s' musí být svazek pojmenován
pl: Etykieta archiwum nie pasuje do `%s'

source: Volume `%s' does not match `%s'
cs: Svazek `%s' neodpovídá vzorku `%s'
pl: Czê¶æ `%s' nie pasuje do `%s'

source: Write checkpoint %d
cs: Zapisuji testovací bod %d
pl: Zapis punktu kontrolnego %d

source: Cannot write to %s
cs: Do %s není mo¾né zapsat
pl: Nie mogê pisaæ do %s

source: Read error on %s
cs: Chyba pøi ètení z %s
pl: B³±d czytania %s

source: At beginning of tape, quitting now
cs: Páska na zaèátku, konèím
pl: Na pocz±tku ta¶my, teraz koñczê

source: Too many errors, quitting
cs: Pøíli¹ mnoho chyb, konèím
pl: Za du¿o b³êdów, koñczê

source: Read checkpoint %d
cs: Ètení testovacího bodu %d
pl: Czytam punkt kontrolny %d

source: Reading %s
cs: Ètení z %s
pl: Czytam %s

source: WARNING: No volume header
cs: VAROVÁNÍ: Chybí hlavièka svazku
pl: UWAGA: Brak etykiety czê¶ci

source: %s is not continued on this volume
cs: %s nepokraèuje na tomto svazku
pl: %s nie jest kontynuowany w tej czê¶ci

source: This volume is out of sequence
cs: Tento svazek není následníkem pøedchozího
pl: Ta czê¶æ nie jest kolejn±

source: Archive %s EOF not on block boundary
cs: Konec (EOF) archivu %s není na hranici bloku
pl: EOF archiwum %s nie jest na granicy bloku

source: WARNING: Cannot close %s (%d, %d)
cs: VAROVÁNÍ: %s není mo¾né uzavøít (%d, %d)
pl: UWAGA: Nie mogê zamkn±æ %s (%d, %d)

source: Could not backspace archive file; it may be unreadable without -i
cs: V archivu se nelze vrátit, proto mù¾e být bez -i neèitelný
pl: Nie mogê siê cofn±æ w pliku archiwum; mo¿e nie byæ czytelny bez -i

source: Child died with signal %d%s
cs: Potomek byl ukonèen signálem %d%s
pl: Proces potomny zosta³ zabity sygna³em %d%s

source: (core dumped)
cs: (soubor `core' vytvoøen)
pl: (zrzut pamiêci)

source: Child returned status %d
cs: Potomek vrátil status %d
pl: Proces potomny zwróci³ stan %d

source: Prepare volume #%d for %s and hit return:
cs: Pøipravte svazek #%d souboru %s a stisknìte return:
pl: Przygotuj czê¶æ numer %d dla %s i naci¶nij return

source: EOF where user reply was expected
cs: Místo u¾ivatelské odpovìdi byl zadán konec souboru
pl: EOF kiedy by³a oczekiwana odpowied¼ u¿ytkownika

source: WARNING: Archive is incomplete
cs: VAROVÁNÍ: Archiv je nekompletní
pl: UWAGA: Archiwum jest niekompletne

source: n [name] Give a new file name for the next (and subsequent) volume(s) q Abort tar ! Spawn a subshell ? Print this list
cs: n [name] Zadání nového jména pro dal¹í (a následující) svazek(ky) q Ukonèení programu tar ! Vytvoøení podshell ? Vypísání této nápovìdy
pl: n [nazwa] Podaj now± nazwê dla nastêpnej (i kolejnych) czê¶ci q Informacje o programie tar ! Uruchom shella ? Wypisz tê listê

source: No new volume; exiting.
cs: Není nový svazek; konèím.
pl: Brak nowej czê¶ci; koñczê.

source: Cannot fork!
cs: Nový proces není mo¾né vytvoøit!
pl: Nie mogê rozwidliæ procesu!

source: Cannot exec a shell %s
cs: Shell %s není mo¾né spustit
pl: Nie mogê uruchomiæ shella %s

source: Cannot read %s
cs: %s nelze èíst
pl: Nie mogê czytaæ %s

source: Data differs
cs: Data se li¹í
pl: Dane siê ró¿ni±

source: Unexpected EOF on archive file
cs: Neoèekávaný konec archívu (EOF)
pl: Niespodziewany EOF w pliku archiwum

source: File does not exist
cs: Soubor neexistuje
pl: Plik nie istnieje

source: Cannot stat file %s
cs: Funkci stat na soubor %s není mo¾né provést
pl: Nie mogê sprawdziæ stanu pliku %s

source: Verify
cs: Ovìøuji
pl: Sprawdzam

source: Unknown file type '%c' for %s, diffed as normal file
cs: Neznámý typ '%c' souboru %s, porovnáván jako normální soubor
pl: Nieznany typ liku %c' dla %s, zrobi³em diff jak dla zwyk³ego pliku

source: Not a regular file
cs: Není obyèejný soubor
pl: Nie jest zwyk³ym plikiem

source: Mode differs
cs: Práva se li¹í
pl: Uprawnienia siê ró¿ni±

source: Uid differs
cs: Uid se li¹í
pl: Uid siê ró¿ni

source: Gid differs
cs: Gid se li¹í
pl: Gid siê ró¿ni

source: Mod time differs
cs: Èas poslední modifikace se li¹í
pl: Czas modyfikacji siê ró¿ni

source: Size differs
cs: Velikost se li¹í
pl: Rozmiar siê ró¿ni

source: Error while closing %s
cs: Chyba pøi uzavírání %s
pl: B³±d w czasie zamykania %s

source: Does not exist
cs: Neexistuje
pl: Nie istnieje

source: Not linked to %s
cs: Není odkazem na %s
pl: Nie do³±czony do %s

source: No such file or directory
cs: Není souborem ani adresáøem
pl: Nie ma takiego pliku ani katalogu

source: Cannot read link %s
cs: Odkaz %s není mo¾né èíst
pl: Nie mogê przeczytaæ ³±cza %s

source: Symlink differs
cs: Symbolický odkaz se li¹í
pl: £±cze symboliczne siê ró¿ni

source: Device numbers changed
cs: Èíslo zaøízení zmìnìno
pl: Numery urz±dzeñ zmienione

source: Mode or device-type changed
cs: Práva nebo typ zaøízení zmìnìn
pl: Zmieni³y siê uprawnienia albo typ urz±dzenia

source: No longer a directory
cs: U¾ není adresáøem
pl: Nie jest ju¿ katalogiem

source: Cannot open file %s
cs: Soubor %s není mo¾né otevøít
pl: Nie mogê otworzyæ pliku %s

source: Could not rewind archive file for verify
cs: Není mo¾né pøejít na zaèátek archivaèního souboru pro ovìøení
pl: Nie mogê przewin±æ pliku archiwum dla weryfikacji

source: VERIFY FAILURE: %d invalid header(s) detected
cs: CHYBNÉ OVÌØENÍ: chybných hlavièek detekováno: %d
pl: B£¡D WERYFIKACJI: wykryto %d b³êdnych nag³ówków

source: Removing drive spec from names in the archive
cs: Odstraòuji jméno disku ze jmen souborù v archivu
pl: Usuwam nazwe napêdu z nazw w archiwum

source: Removing leading `/' from absolute path names in the archive
cs: Odstraòuji úvodní `/' z absolutních cest v archivu
pl: Usuwam pocz±tkowy `/' ze ¶cie¿ek absolutnych w archiwum

source: Cannot add file %s
cs: Soubor %s není mo¾né pøidat
pl: Nie mogê dodaæ pliku %s

source: %s: is unchanged; not dumped
cs: %s: není zmìnìn; neaktualizován
pl: %s: jest niezmienione; nie zapisujê

source: %s is the archive; not dumped
cs: %s je archív; nearchivován
pl: %s jest tym archiwum; nie zapisujê

source: Removing leading `/' from absolute links
cs: Odstraòuji úvodní `/' z absolutních odkazù
pl: Usuwam pocz±tkowy `/' ze ¶cie¿ek bezwzglêdnych

source: Cannot remove %s
cs: %s není mo¾né smazat
pl: Nie mogê usun±æ %s

source: Cannot add directory %s
cs: %s není mo¾né pøidat
pl: Nie mogê dodaæ katalogu %s

source: %s: On a different filesystem; not dumped
cs: %s je na jiném souborovém systému; nearchivován
pl: %s: W innym systemie plików; nie zapisujê

source: Cannot open directory %s
cs: Do adresáøe %s není mo¾né vstoupit
pl: Nie mogê otworzyæ katalogu %s

source: File name %s%s too long
cs: Jméno souboru %s%s je pøíli¹ dlouhé
pl: Nazwa pliku %s%s jest za d³uga

source: %s: Unknown file type; file ignored
cs: %s: Neznámý typ souboru; soubor ignorován
pl: %s: Nieznany typ pliku; plik zignorowany

source: Could not re-position archive file
cs: Pozici v archivu není mo¾né zmìnit
pl: Nie mogê ponownie ustawiæ pozycji w pliku archiwum

source: This does not look like a tar archive
cs: Toto pravdìpodobnì není tar archív
pl: To nie wygl±da jak archiwum tar

source: Skipping to next header
cs: Pøeskakuji na dal¹í hlavièku
pl: Przeskakujê do nastêpnego nag³ówka

source: Deleting non-header from archive
cs: Z archivu je mazáno to, co není hlavièka
pl: Kasujê z archiwum nie-nag³ówek

source: %s: Could not change access and modification times
cs: %s: Zmìnit pøístupový èas a èas poslední modifikace není mo¾né
pl: %s: Nie mogê zmieniæ czasów dostêpu i modyfikacji

source: %s: Could not write to file
cs: %s: Do souboru není mo¾né zapisovat
pl: %s: Nie mogê pisaæ do pliku

source: %s: Was unable to backup this file
cs: %s: Tento soubor nebylo mo¾né zálohovat
pl: %s: Nie mog³em zrobiæ kopii zapasowej tego pliku

source: Extracting contiguous files as regular files
cs: Souvisle ulo¾ené soubory rozbaluji jako obyèejné soubory
pl: Odtwarzam pliki ci±g³e jako zwyk³e

source: %s: Could not create file
cs: %s: Není mo¾né vytvoøit soubor
pl: %s: Nie mog³em utworzyæ pliku

source: %s: Error while closing
cs: %s: Chyba pøi uzavírání
pl: %s: B³±d w czasie zamykania

source: %s: Could not create symlink to `%s'
cs: %s: symbolický odkaz na `%s' není mo¾né vytvoøit
pl: %s: Nie mog³em utworzyæ ³±cza symbolicznego do %s'

source: Attempting extraction of symbolic links as hard links
cs: Zkou¹ím rozbalit symbolické odkazy jako pevné odkazy
pl: Próbujê odtworzyæ ³±cza symboliczne jako zwyk³e

source: %s: Could not link to `%s'
cs: %s: symbolický odkaz na `%s' nelze vytvoøit
pl: %s: Nie mog³em do³±czyæ do %s'

source: %s: Could not make node
cs: %s: Uzel nelze vytvoøit
pl: %s: Nie mog³em utworzyæ pliku specjalnego

source: %s: Could not make fifo
cs: %s: Není mo¾né vytvoøit rouru
pl: %s: Nie mog³em utworzyæ fifo

source: %s: Could not create directory
cs: %s: Není mo¾né vytvoøit adresáø
pl: %s: Nie mog³em utworzyæ katalogu

source: Added write and execute permission to directory %s
cs: Pøidána práva zápisu a vykonání adresáøi %s
pl: Dodane uprawnienia pisania i wykonywania do katalogu %s

source: Cannot extract `%s' -- file is continued from another volume
cs: `%s' není mo¾né rozbalit -- soubor je pokraèováním jiného
pl: Nie mogê odtworzyæ %s' -- plik jest kontynuowany z innej czê¶ci

source: Visible long name error
cs: Viditelná chyba dlouhého jména
pl: B³±d d³ugiej nazwy

source: Unknown file type '%c' for %s, extracted as normal file
cs: Neznámý typ `%c' souboru %s, rozbalen jako normální soubor
pl: Nieznay typ pliku `%c' dla %s; odtworzony jako plik zwyk³y

source: Cannot stat %s
cs: Funkci stat na %s není mo¾né vykonat
pl: Nie mogê uzyskaæ informacji (stat) o %s

source: Directory %s has been renamed
cs: Adresáø %s byl pøejmenován
pl: Nazwa katalogu %s zosta³a zmieniona

source: Directory %s is new
cs: Adresáø %s je nový
pl: Katalog %s jest nowy

source: Could not get current directory
cs: Aktuální adresáø nelze èíst
pl: Nie mog³em siê dostaæ do bie¿±cego katalogu

source: Could not get current directory: %s
cs: Aktuální adresáø %s nelze èíst
pl: Nie mog³em siê dostaæ do bie¿±cego katalogu: %s

source: File name %s/%s too long
cs: Jméno souboru %s/%s je pøíli¹ dlouhé
pl: Nazwa pliku %s/%s jest za d³uga

source: Cannot chdir to %s
cs: Do adresáøe %s není mo¾né vstoupit
pl: Nie mogê zmieniæ katalogu na %s

source: Unexpected EOF in archive
cs: Neoèekávaný konec archívu
pl: Nieoczekiwany EOF w archiwum

source: %s: Deleting %s
cs: %s: Ma¾u %s
pl: %s: Usuwam %s

source: Error while deleting %s
cs: Pøi mazání %s nastala chyba
pl: B³±d w czasie usuwania %s

source: Omitting %s
cs: Vynechávám %s
pl: Pomijam %s

source: Hmm, this doesn't look like a tar archive
cs: Tento soubor nevypadá jako tar archív
pl: Hmm..., to nie wygl±da jak archiwum tar

source: Skipping to next file header
cs: Pøeskakuji na dal¹í hlavièku
pl: Przeskakujê do nastêpnego nag³ówka pliku

source: EOF in archive file
cs: EOF v archívu
pl: EOF w pliku archiwum

source: Visible longname error
cs: Viditelná chyba dlouhého jména
pl: B³±d d³ugiej nazwy

source: link to %s
cs: odkaz na %s
pl: ³±cze do %s

source: unknown file type `%c'
cs: neznámý typ `%c' souboru
pl: nieznany typ pliku `%c'

source: --Volume Header--
cs: --Hlavièka svazku--
pl: --Nag³ówek czê¶ci--

source: --Mangled file names--
cs: --Rozsekané jméno souboru--
pl: --Zakodowane nazwy plików--

source: Creating directory:
cs: Vytváøím adresáø:
pl: Tworzê katalog:

source: Unexpected EOF in mangled names
cs: Neoèekávaný konec v rozsekaném jménì
pl: Niespodziewany EOF w zakodowanych nazwach

source: Cannot rename %s to %s
cs: %s není mo¾né pøejmenovat na %s
pl: Nie mogê przemianowaæ %s na %s

source: Renamed %s to %s
cs: Soubor %s pøejmenován na %s
pl: Przemianowa³em %s na %s

source: Cannot symlink %s to %s
cs: symbolický odkaz %s na %s není mo¾né vytvoøit
pl: Nie mogê utworzyæ ³±cza symbolicznego z %s do %s

source: Symlinked %s to %s
cs: %s odkazuje na %s
pl: Do³±czy³em symbolicznie %s do %s

source: Unknown demangling command %s
cs: Neznámý pøíkaz %s pro spojování rozsekaných jmen
pl: Nieznana komenda odkodowuj±ca nazwy %s

source: Cannot change to directory %s
cs: Do adresáøe %s není mo¾né vstoupit
pl: Nie mogê przej¶æ do katalogu %s

source: Missing file name after -C
cs: Za -C chybí jméno souboru
pl: Brakuj±ca nazwa pliku po -C

source: %s: Not found in archive
cs: %s: V archivu nenalezen
pl: %s: Nie znalaz³em w archiwum

source: rmtd: Cannot allocate buffer space
cs: rmtd: Místo pro buffer není mo¾né alokovat
pl: rmtd: Nie mogê przydzieliæ miejsca na bufor

source: Cannot allocate buffer space
cs: Místo pro buffer není mo¾né alokovat
pl: Nie mogê przydzieliæ miejsca na bufor

source: rmtd: Premature eof
cs: rmtd: Pøedèasný konec souboru
pl: rmtd: Przedwczesny EOF

source: Premature end of file
cs: Pøedèasný konec souboru
pl: Przedwczesny koniec pliku

source: rmtd: Garbage command %c
cs: rmtd: Neznámý pøíkaz %c
pl: rmtd: Bezsensowna komenda %c

source: Garbage command
cs: Neznámý pøíkaz
pl: Bezsensowna komenda

source: exec/tcp: Service not available
cs: exec/tcp: Slu¾ba není k dispozici
pl: exec/tcp: Us³uga niedostêpna

source: Cannot execute remote shell
cs: Vzdálený shell není mo¾né spustit
pl: Nie mogê wykonaæ zdalnego shella

source: Options `-%s' and `-%s' both want standard input
cs: Pøepínaèe `-%s' a `-%s' oba dva chtìjí standardní vstup
pl: Opcje `-%s' i `-%s' obie chc± dostêpu do standardowego wej¶cia

source: Cannot read confirmation from user
cs: Potvrzení od u¾ivatele není mo¾né èíst
pl: Nie mogê przeczytaæ potwiedzenia u¿ytkownika

source: Try `%s --help' for more information.
cs: Více informací získáte pøíkazem `%s --help'.
pl: Spróbuj `%s --help' ¿eby otrzymaæ wiêcej informacji

source: GNU `tar' saves many files together into a single tape or disk archive, and can restore individual files from the archive.
cs: GNU `tar' je archivaèní program. Ukládá soubory do archivu na pásku nebo disk. Z archivu doká¾e rozbalit jak celé hierarchie souborù, tak i jednotlivé soubory.
pl: `tar' GNU zapisuje wiele plików razem na na jednej ta¶mie lub archiwum dyskowym i mo¿e odzyskaæ poszczególne pliki z archiwum.

source: Usage: %s [OPTION]... [FILE]...
cs: Pou¾ití: %s [PØEPÍNAÈ]... [SOUBOR]...
pl: U¿ycie: %s [OPCJA]... [PLIK]...

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
cs: Jestli¾e dlouhé pøepínaèe mají povinný argument, pak tento argument je povinný i u jejich krátkých forem. Obdobnì je tomu v pøípadì, kdy je argument nepovinný.
pl: Argumenty obowi±zkowe dla opcji d³ugich obowi±zuj± równie¿ dla krótkich. Podobnie je¿eli argument jest podany jako opcjonalny.

source: Main operation mode: -t, --list list the contents of an archive -x, --extract, --get extract files from an archive -c, --create create a new archive -d, --diff, --compare find differences between archive and file system -r, --append append files to the end of an archive -u, --update only append files newer than copy in archive -A, --catenate append tar files to an archive --concatenate same as -A --delete delete from the archive (not on mag tapes!)
cs: Hlavní funkce: -t, --list vypí¹e obsah archivu -x, --extract, --get vyzvede soubor(y) z archivu -c, --create vytvoøí nový archiv -d, --diff, --compare nalezne rozdíly mezi archivem a souborovým systémem -r, --append pøidá soubory na konec archivu -u, --update pøidá pouze soubory novìj¹í, ne¾ jsou v archivu -A, --catenate pøidá soubory z tar archivu do archivu --concatenate stejné jako -A --delete ma¾e z archivu (nefunguje na magnetických páskách)
pl: G³ówny tryb dzi³ania: -t, --list wypisz zawarto¶æ archiwum -x, --extract, --get rozpakuj pliki z archiwum -c, --create utwórz nowe archiwum -d, --diff, --compare znajd¼ ró¿nice miêdzy archiwum i plikami na dysku -r, --append do³±cz pliki na koñcu archiwum -u, --update do³±cz tylko pliki nowsze ni¿ kopia w archiwum -A, --catenate do³±cz pliki tar do archiwum --concatenate to samo co -A --delete skasuj pliki z archiwum (nie na ta¶mie!)

source: Operation modifiers: -W, --verify attempt to verify the archive after writing it --remove-files remove files after adding them to the archive -k, --keep-old-files don't overwrite existing files when extracting -U, --unlink-first remove each file prior to extracting over it --recursive-unlink empty hierarchies prior to extracting directory -S, --sparse handle sparse files efficiently -O, --to-stdout extract files to standard output -G, --incremental handle old GNU-format incremental backup -g, --listed-incremental handle new GNU-format incremental backup --ignore-failed-read do not exit with nonzero on unreadable files
cs: Modifikátory operací: -W, --verify ovìøí archív po jeho zápisu na médium --remove-files sma¾e originální soubory po jejich archivaci -k, --keep-old-files nepøepisuje soubory pøi rozbalování archivu -U, --unlink-first sma¾e soubory pøed jejich pøepsáním --recursive-unlink sma¾e prázdné hierarchie pøed rozbalováním adresáøù -S, --sparse soubory s dírami zpracuje efektivnìji -O, --to-stdout rozbalí archiv na standardní výstup -G, --incremental zpracuje starý GNU-formát inkrementální zálohy -g, --listed-incremental zpracuje nový GNU-formát inkrementální zálohy --ignore-failed-read ignoruje chyby pøi ètení souborù
pl: Modyfikatory dzia³ania: -W, --verify spróbuj zweryfikowaæ archiwum po zapisaniu --remove-files usuñ pliki po dodaniu do archiwum -k, --keep-old-files nie zamazuj istniej±cych plików rozpakowanymi -U, --unlink-first usuñ ka¿dy plik przed zamazaniem go rozpakowanym --recursive-unlink usuñ stary katalog przed rozpakowaniem nowego -S, --sparse dzia³aj efektywnie na plikach rzadkich -O, --to-stdout rozpakuj pliki na standardowe wyj¶cie -G, --incremental backup przyrostowy w starym formacie GNU -g, --listed-incremental backup przyrostowy w nowym formacie GNU --ignore-failed-read nie koñcz b³êdem je¿eli nieczytelne pliki

source: Handling of file attributes: --owner=NAME force NAME as owner for added files --group=NAME force NAME as group for added files --mode=CHANGES force (symbolic) mode CHANGES for added files --atime-preserve don't change access times on dumped files -m, --modification-time don't extract file modified time --same-owner try extracting files with the same ownership --numeric-owner always use numbers for user/group names -p, --same-permissions extract all protection information --preserve-permissions same as -p -s, --same-order sort names to extract to match archive --preserve-order same as -s --preserve same as both -p and -s
cs: Zpracování atributù souborù: --owner=JMÉNO pou¾ije JMÉNO jako vlastníka pøidávaných souborù --group=JMÉNO pou¾ije JMÉNO jako skupinu pøidávaných souborù --mode=OSMIÈKOVÌ pou¾ije OSMIÈKOVÌ jako práva pøidávaných souborù --atime-preserve nemìní pøístupový èas na zpracovávaných souborech -m, --modification-time u rozbalovávaných souborù nenastaví èas poslední modifikace souboru z archivu --same-owner u rozbalovávaných souborù nastaví stejného vlastníka jako je v archivu --numeric-owner v¾dy pou¾ívá èísla pro jména vlastníka/skupiny -p, --same-permissions u rozbalovávaných souborù nastaví stejná práva, jaká mají v archivu --preserve-permissions stejné jako -p -s, --same-order seøazení jmen souborù pro rozbalení je stejné s archivem --preserve-order stejné jako -s --preserve stejné jako zadání -p a -s
pl: Przetwarzanie atrybutów plików: --owner=NAZWA nadaj w³a¶ciciela NAZWA dodanym plikom --group=NAME nadaj grupê NAZWA dodanym plikom --mode=ÓSEMK nadaj uprawnienia ÓSEMK dodanym plikom --atime-preserve nie zmieniaj czasu dostêpu pakowanych plików -m, --modification-time nie zapisuj czasu modyf. rozpakowanego pliku --same-owner próbuj rozpakowaæ pliki z tym samym w³a¶cicielem --numeric-owner u¿ywaj numerów, nie nazw uzytkowników/grup -p, --same-permissions rozpakuj ca³± informacjê o uprawnieniach --preserve-permissions to samo co -p -s, --same-order posortuj rozpakowne nazwy dla porównania --preserve-order to samo co -s --preserve to samo co równocze¶nie -p i -s
