Repository: dslm4515/MLFS-pkgtool
Catalog: contrib/tar-1.13/po/*.po
Languages: cs, pl

source: Device selection and switching: -f, --file=ARCHIVE use archive file or device ARCHIVE --force-local archive file is local even if has a colon --rsh-command=COMMAND use remote COMMAND instead of rsh -[0-7][lmh] specify drive and density -M, --multi-volume create/list/extract multi-volume archive -L, --tape-length=NUM change tape after writing NUM x 1024 bytes -F, --info-script=FILE run script at end of each tape (implies -M) --new-volume-script=FILE same as -F FILE --volno-file=FILE use/update the volume number in FILE
cs: Výbìr zaøízení: -f, --file=ARCHIV pracuje s archivem nebo zaøízením ARCHIV --force-local archivní soubor je lokální, dokonce i kdy¾ obsahuje ve jménì dvojteèku --rsh-command=PØÍKAZ pou¾ije PØÍKAZ pro pøihlá¹ení místo rsh -[0-7][lmh] zadání zaøízení a hustoty -M, --multi-volume práce s vícesvazkovým archivem -L, --tape-length=ÈÍSLO vymìní pásku po zapsání ÈÍSLO x 1024 bajtù -F, --info-script=SOUBOR spustí script na konci ka¾dé pásky (zahrnuje i -M) --new-volume-script=SOUBOR stejné jako -F SOUBOR --volno-file=SOUBOR pou¾ije/aktualizuje èíslo svazku v SOUBORu
pl: Wybór i prze³±czanie urz±dzeñ: -f, --file=ARCHIWUM u¿yj pliku lub urz±dzenia ARCHIWUM --force-local plik archiwum lokalny, nawet z dwukropkiem --rsh-command=KOMENDA u¿yj KOMENDY zamiast rsh -[0-7][lmh] podaj napêd i gêsto¶æ -M, --multi-volume twórz/wypisz/rozpakuj archiwum wieloczê¶ciowe -L, --tape-length=ILE zmieñ ta¶mê po zapisaniu ILE x 1024 bajtów -F, --info-script=PLIK uruchom skrypt na koñcu ta¶my (w³±cza -M) --new-volume-script=PLIK to samo co -F PLIK --volno-file=PLIK u¿yj/uaktualnij numer czê¶ci w PLIKu

source: Device blocking: -b, --blocking-factor=BLOCKS BLOCKS x 512 bytes per record --record-size=SIZE SIZE bytes per record, multiple of 512 -i, --ignore-zeros ignore zeroed blocks in archive (means EOF) -B, --read-full-records reblock as we read (for 4.2BSD pipes)
cs: Bloky u zaøízení: -b, --blocking-factor=BLOKÙ BLOKÙ x 512 bajtù na záznam --record-size=VELIKOST VELIKOST bajtù na záznam, násobek 512 -i, --ignore-zeros ignoruje nulové bloky v archivu, které normálnì znamenají EOF. -B, --read-full-records kdy¾ není pøeèteno tolik bajtù, kolik je po¾adováno, zkou¹í doèíst zbytek (vhodné pro roury)
pl: Parametry bloków: -b, --blocking-factor=BLOKI BLOKI x 512 bajtów na rekord --record-size=ROZMIAR ROZMIAR bajtów na rekord, wielokrotno¶æ 512 -i, --ignore-zeros ignoruj wyzerowane bloki (oznacza EOF) -B, --read-full-records podziel na bloki czytaj±c (dla pipe 4.2BSD)

source: Archive format selection: -V, --label=NAME create archive with volume name NAME PATTERN at list/extract time, a globbing PATTERN -o, --old-archive, --portability write a V7 format archive --posix write a POSIX conformant archive -z, --gzip, --ungzip filter the archive through gzip -Z, --compress, --uncompress filter the archive through compress --use-compress-program=PROG filter through PROG (must accept -d)
cs: Výbìr formátu archívu: -V, --label=JMÉNO vytvoøí archiv se jménem svazku JMÉNO VZOREK u obsahu/rozbalování globální vzorek pro jména souborù -o, --old-archive, --portability zapí¹e archiv ve formátu V7 --posix zapí¹e archiv ve formátu POSIX -z, --gzip, --ungzip filtruje archiv pøes gzip -Z, --compress, --uncompress filtruje archiv pøes compress --use-compress-program=PROG filtruje pøes PROG (musí akceptovat -d)
pl: Wybór formatu archiwum: -V, --label=NAZWA utwórz archiwum z etykiet± NAZWA WZORZEC przy wypisywaniu/rozpakowaniu -o, --old-archive, --portability zapisz archiwum w formacie V7 --posix zapisz archiwum zgodne z POSIX-em -z, --gzip, --ungzip filtruj archiwum przez gzip -Z, --compress, --uncompress filtruj archiwum przez compess --use-compress-program=PROG filtruj przez PROGram (musi akceptowac -d)

source: Local file selection: -C, --directory=DIR change to directory DIR -T, --files-from=NAME get names to extract or create from file NAME --null -T reads null-terminated names, disable -C --exclude=PATTERN exclude files, given as a globbing PATTERN -X, --exclude-from=FILE exclude globbing patterns listed in FILE -P, --absolute-names don't strip leading `/'s from file names -h, --dereference dump instead the files symlinks point to --no-recursion avoid descending automatically in directories -l, --one-file-system stay in local file system when creating archive -K, --starting-file=NAME begin at file NAME in the archive
cs: Výbìr souborù: -C, --directory=ADRESÁØ operace vykonává v ADRESÁØi -T, --files-from=JMÉNO pøi rozbalování nebo vytváøení bere názvy souborù ze souboru JMÉNO --null -T ète nulou ukonèené jména, zakázáno -C --exclude=VZOREK nepracuje se soubory odpovídající VZORKu -X, --exclude-from=SOUBOR nepracuje se soubory, které odpovídají nìkterému vzorku v SOUBORu -P, --absolute-names neodstraòuje úvodní `/' ze jmen souborù -h, --dereference místo symbolických odkazù pou¾ije soubory, na které odkazy ukazují --no-recursion neprochází adresáøe -l, --one-file-system pøi vytváøení archivu zùstane v jednom souborovém systému -K, --starting-file=JMÉNO zaène od souboru JMÉNO z archivu
pl: Wybór plików lokalnych: -C, --directory KATALOG przejd¼ do KATALOGu -T, --files-from=NAZWA nazwy plików do roz/zapakowania s± w pliku NAZWA --null -T czyta nazwy zakoñczone zerem, wy³±cz -C --exclude=WZORZEC wyklucz nazwy pasuj±ce do WZORCA -X, --exclude-from=PLIK wyklucz nazwy pasuj±ce do wzorców w PLIKu -P, --absolute-names nie usuwaj pocz±tkowego '/' z nazw plików -h, --dereference zamiast plików pakuj symlinki na nie wskazuj±ce --no-recurse nie wg³êbiaj siê automatycznie w katalogi -l, --one-file-system archiwizuj±c pozostañ w jednym systemi plików -K, --starting-file=NAZWA zacznij od pliku o tej NAZWie w archiwum

source: -N, --newer=DATE only store files newer than DATE --newer-mtime compare date and time when data changed only --after-date=DATE same as -N
cs: -N, --newer=DATUM archivuje pouze soubory novìj¹í ne¾ DATUM --newer-mtime=DATUM archivuje pouze soubory, jejich¾ datum poslední zmìny dat je novìj¹í ne¾ DATUM --after-date=DATUM stejné jako -N
pl: -N, --newer=DATA zapisuj tylko pliki nowsze ni¿ DATA --newer-mtime porównuj datê i czas tylko dla zmienionych danych --after-date=DATA to samo co -N

source: --backup[=CONTROL] backup before removal, choose version control --suffix=SUFFIX backup before removel, override usual suffix
cs: --backup[=ØÍZENÍ] zpùsob zálohování souborù, pøed jejich pøepsáním --suffix=PØÍPONA zálohuje pøed pøepsáním (smazáním), jako pøíponu u zálo¾ních souborù pou¾ije PØÍPONU
pl: --backup[=TRYB] kopia zapasowa przed usuniêciem, wybierz tryb zarz±dzania wersjami --suffix=PRZYROSTEK kopia zapasowa przed usniêciem, zmieñ domy¶lny PRZYROSTEK

source: Informative output: --help print this help, then exit --version print tar program version number, then exit -v, --verbose verbosely list files processed --checkpoint print directory names while reading the archive --totals print total bytes written while creating archive -R, --block-number show block number within archive with each message -w, --interactive ask for confirmation for every action --confirmation same as -w
cs: Informativní výstup: --help vypí¹e tuto nápovìdu a skonèí --version vypí¹e oznaèení verze programu tar a skonèí -v, --verbose vypisuje zpracovávané soubory --checkpoint vypisuje jména adresáøù pøi ètení archivu --totals vypí¹e celkem zapsaných bajtù pøi tvorbì archivu -R, --block-number s ka¾dou zprávou vypí¹e èíslo bloku v archivu -w, --interactive ¾ádá potvrzení ka¾dé akce --confirmation stejné jako -w
pl: Informacje: --help wy¶wietl ten opis i zakoñcz --version wy¶wietl informacjê o wersji tar-a i zakoñcz -v, --verbose wypisuj szczegó³y o przetwarzanych plikach --checkpoint wypisuj nazwy katalogów podczas czytania archiwum --totals wypisz ca³kowit± ilo¶c bajtów zapisanych do archiwum -R, --block-number przy ka¿dej informacji podaj numer bloku w archiwum -w, --interactive pytaj o potwierdzenie ka¿dej akcji --confirmation to samo co -w

source: The backup suffix is `~', unless set with --suffix or SIMPLE_BACKUP_SUFFIX. The version control may be set with --backup or VERSION_CONTROL, values are: t, numbered make numbered backups nil, existing numbered if numbered backups exist, simple otherwise never, simple always make simple backups
cs: Pøípona zálo¾ních souborù bude `~', pokud není nastavena pomocí --suffix nebo promìnné SIMPLE_BACKUP_SUFFIX. Jak se mají tvoøit zálo¾ní kopie, mù¾e být nastaveno pomocí pøepínaèe --backup nebo promìnné VERSION_CONTROL. Hodnoty mohou být: t, numbered tvoøí èíslované zálo¾ní kopie nil, existing èíslované, jestli¾e ji¾ èíslované zálo¾ní kopie existují, jinak tvoøí jednoduché never, simple tvoøí v¾dy jednoduché zálo¾ní kopie souborù
pl: Przyrostek kopii zapasowej to `~', je¿eli nie zosta³ zmieniony przez --suffix lub SIMPLE_BACKUP_SUFFIX. Sposób zarz±dzania wersjami mo¿e byæ zmieniony przez --backup lub VERSION_CONTROL, mo¿liwe warto¶ci: t, numbered zrób numerowane kopie zapasowe nil, existing numerowane je¿eli takie ju¿ s±, w przeciwnym wypadku proste never, simple proste kopie zapasowe

source: GNU tar cannot read nor produce `--posix' archives. If POSIXLY_CORRECT is set in the environment, GNU extensions are disallowed with `--posix'. Support for POSIX is only partially implemented, don't count on it yet. ARCHIVE may be FILE, HOST:FILE or USER@HOST:FILE; and FILE may be a file or a device. *This* `tar' defaults to `-f%s -b%d'.
cs: GNU tar neumí èíst nebo produkovat `--posix' archivy. Jestli¾e je v prostøedí nastaveno POSIXLY_CORRECT, GNU roz¹íøení je zablokováno pøepínaèem `--posix'. Podpora POSIX formátu je èásteènì implementována, proto s ní pøíli¹ nepoèítejte. ARCHIV mù¾e být SOUBOR, HOSTITEL:SOUBOR nebo U®IVATEL@HOSTITEL:SOUBOR, SOUBOR mù¾e být soubor nebo zaøízení. Implicitní pøepínaèe jsou `-f %s -b %d'.
pl: GNU tar mo¿e czytaæ ani zapisywaæ archiwów `--posix'. Je¿eli w ¶rodowisku jest ustawiona zmienna POSSIXLY_CORRECT rozszerzenia GNU s± wy³±czone przy u¿ywaniu `--posix'. Format posixowy jest zaimplementowany tylko czê¶ciowo, na razie nie licz na niego. ARCHIWUM mo¿e byæ PLIKiem, KOMPUTER:PLIK lub U¯YTKOWNIK@KOMPUTER:PLIK, PLIK mo¿e byæ plikiem lub urz±dzeniem. Opcje domy¶lne *tego* tara to `-f%s -b%d'.

source: Report bugs to <tar-bugs@gnu.org>.
cs: Chyby v programu oznamujte na adrese <tar-bugs@gnu.org> (pouze anglicky), pøipomínky k pøekladu zasílejte na adresu <cs@li.org> (èesky).
pl: Raporty o b³êdach wysy³aj do <tar-bugs@gnu.org>.

source: You may not specify more than one `-Acdtrux' option
cs: Více jak jeden pøepínaè z `-Acdtrux' nemù¾e být zadán
pl: Nie mo¿esz podaæ wiêcej ni¿ jednej opcji `-Acdtrux'

source: Conflicting compression options
cs: Odporující si kompresní pøepínaèe
pl: Niezgodne opcje kompresji

source: Old option `%c' requires an argument.
cs: Pøepínaè `%c' vy¾aduje argument.
pl: Stara opcja `%c' wymaga argumentu.

source: Obsolete option, now implied by --blocking-factor
cs: Zastaralý pøepínaè, nyní zahrnut v pøepínaèi --blocking-factor
pl: Przestarza³a opcja, teraz w³±cza j± --blocking-factor

source: Obsolete option name replaced by --blocking-factor
cs: Zastaralý pøepínaè, nahrazen pøepínaèem --blocking-factor
pl: Przestarza³a opcja, wymieniona na --blocking-factor

source: Obsolete option name replaced by --read-full-records
cs: Zastaralý pøepínaè, nahrazen pøepínaèem --read-full-records
pl: Przestarzala nazwa opcji zmieniona na --read-full-records

source: Obsolete option name replaced by --touch
cs: Zastaralý pøepínaè, nahrazen pøepínaèem --touch
pl: Przestarza³a nazwa opcja zamieniona na --touch

source: More than one threshold date
cs: Více ne¾ jedeno poèáteèní datum
pl: Wiêcej ni¿ jedna data graniczna

source: Invalid date format `%s'
cs: Chybný formát data `%s'
pl: B³êdny format daty `%s'

source: Conflicting archive format options
cs: Odporující si archivní formáty
pl: Niezgodne opcje formatu archiwum

source: Obsolete option name replaced by --absolute-names
cs: Zastaralý pøepínaè, nahrazen pøepínaèem --absolute-names
pl: Przestarza³a nazwa opcji zamieniona na --absolute-names

source: Obsolete option name replaced by --block-number
cs: Zastaralý pøepínaè, nahrazen pøepínaèem --block-number
pl: Przestarza³a nazwa opcji zamieniona na --block-number

source: Obsolete option name replaced by --backup
cs: Zastaralý pøepínaè, nahrazen pøepínaèem --backup
pl: Przestarza³a nazwa opcji, zamieniona na --backup

source: Invalid group given on option
cs: Zadána neplatná skupina
pl: B³êdna grupa podana w opcji

source: Invalid mode given on option
cs: Zadána chybná práva
pl: B³êdne uprawnienia podane w opcji

source: Invalid owner given on option
cs: Zadán neplatný vlastník
pl: B³êdny w³a¶ciciel podany w opcji

source: Record size must be a multiple of %d.
cs: Velikost záznamu musí být násobek %d.
pl: Rozmiar rekordu musi byæ wielokrotno¶ci± %d

source: Options `-[0-7][lmh]' not supported by *this* tar
cs: Pøepínaè `-[0-7][lmh]' není podporován tímto tarem
pl: Opcje `-[0-7][lmh]' nie s± u¿ywane w *tym* tarze

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
cs: Toto je volné programové vybavení; podmínky pro kopírování a roz¹iøování naleznete ve zdrojových textech. Toto programové vybavení je zcela BEZ ZÁRUKY, a to i bez záruky PRODEJNOSTI nebo VHODNOSTI PRO NÌJAKÝ KONKRÉTNÍ ÚÈEL.
pl: Ten program jest darmowy; warunki kopiowania s± opisane w ¼ród³ach. Autorzy nie daj± ¯ADNYCH gwarancji, w tym równie¿ gwarancji PRZYDATNO¦CI DO SPRZEDA¯Y LUB DO KONKRETNYCH CELÓW.

source: Written by John Gilmore and Jay Fenlason.
cs: Autoøi: John Gilmore a Jay Fenlason.
pl: Napisany przez Johna Gilmore'a i Jay'a Fenlasona.

source: GNU features wanted on incompatible archive format
cs: GNU roz¹íøení po¾adovány na nekompatibilním formátu archivu
pl: Próba u¿ycia rozszerzeñ GNU z niekompatybilnym formatem archiwum

source: Multiple archive files requires `-M' option
cs: Více archivaèních souborù vy¾aduje pøepínaè `-M'
pl: Wiele plików archiwum wymaga opcji `-M'

source: Cowardly refusing to create an empty archive
cs: Vytvoøení prázdného archívu odmítnuto.
pl: Tchórzliwie odmawiam utworzenia pustego archiwum

source: Options `-Aru' are incompatible with `-f -'
cs: Pøepínaèe `-Aru' jsou nesluèitelné s pøepínaèem `-f -'
pl: Opce `-Aru s± niekompatybilne z `-f -'

source: You must specify one of the `-Acdtrux' options
cs: Musíte zadat jeden z pøepínaèù `-Acdtrux'
pl: Musisz podaæ jedn± z opcji `-Acdtrux'

source: Error exit delayed from previous errors
cs: Za bìhu programu nastala chyba
pl: Zakoñczenie z b³êdem z powodu uprzednich b³êdów

source: Generate data files for GNU tar test suite.
cs: Generuji datové soubory pro testování GNU taru.
pl: Utwórz pliki danych do zestawu testów tara GNU.

source: Usage: %s [OPTION]...
cs: Pou¾ití: %s [PØEPÍNAÈ]...
pl: U¿ycie: %s [OPCJA]...

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. -l, --file-length=LENGTH LENGTH of generated file -p, --pattern=PATTERN PATTERN is `default' or `zeros' --help display this help and exit --version output version information and exit
cs: Povinné argumenty u dlouhých pøepínaèù, jsou povinné také u odpovídajících krátkých pøepínaèù. -l, --file-length délka generovaného souboru --help vypí¹e tuto nápovìdu a skonèí --version vypí¹e oznaèení verze a skonèí
pl: Argumenty obowi±zkowe dla opcji d³ugich obowiazuj± równie¿ dla odpowiednich krótkich. -l, --file-length=D£UGO¦Æ D£UGO¦Æ utworzonego pliku -p, --pattern=WZÓR WZÓR: `default' (domy¶lny) albo `zeros' (zera) --help wy¶wietl ten opis i zakoñcz --version wy¶wietl informacjê o wersji i zakoñcz

source: Ambiguous pattern `%s'
cs: Nejednoznaèný vzorek `%s'
pl: Niejednoznaczny wzór `%s'

source: Unknown pattern `%s'
cs: Neznámý vzorek `%s'
pl: Nieznany wzór `%s'

source: Written by François Pinard <pinard@iro.umontreal.ca>.
cs: Autor: François Pinard <pinard@iro.umontreal.ca>.
pl: Napisany przez Françoisa Pinarda <pinard@iro.umontreal.ca>.
